heatExchanger/cylinders_in_the_middle/constant/fins/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/fins/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    base_fins
    {
        type            patch;
        nFaces          458;
        startFace       4754;
    }
    fins_to_fluid
    {
        type            mappedWall;
        inGroups        List<word> 1(wall);
        nFaces          1254;
        startFace       5212;
        sampleMode      nearestPatchFace;
        sampleRegion    fluid;
        samplePatch     fluid_to_fins;
    }
    fins_to_heater
    {
        type            mappedWall;
        inGroups        List<word> 1(wall);
        nFaces          64;
        startFace       6466;
        sampleMode      nearestPatchFace;
        sampleRegion    heater;
        samplePatch     heater_to_fins;
    }
)

// ************************************************************************* //
