heatExchanger/cylinders_in_the_middle/0/fluid/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 296.9;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet_fluid
    {
        type            fixedValue;
        value           $internalField;
    }
    
    outlet_fluid
    {
        type            inletOutlet;
        value           $internalField;
        inletValue      $internalField;
    }
    
    fluid_to_fins
    {
        type            compressible::turbulentTemperatureCoupledBaffleMixed;
        value           $internalField;
        Tnbr            T;
    }

    walls_fluid
    {
        type            zeroGradient;
    }    
}

// ************************************************************************* //
